7767517
215 248
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 4 in0 1 2 3 4
Crop                     slice_0                  1 1 4 5 -23310=2,-233,-233 -23311=2,1,2 -23309=2,0,0
Crop                     slice_1                  1 1 3 6 -23310=2,-233,-233 -23311=2,1,2 -23309=2,1,0
Crop                     slice_2                  1 1 2 7 -23310=2,-233,-233 -23311=2,1,2 -23309=2,0,1
Crop                     slice_3                  1 1 1 8 -23310=2,-233,-233 -23311=2,1,2 -23309=2,1,1
Concat                   cat_0                    4 1 5 6 7 8 9 0=0
Convolution              conv_0                   1 1 9 10 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456
Swish                    silu_65                  1 1 10 11
Convolution              conv_1                   1 1 11 12 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_66                  1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_2                   1 1 15 16 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_67                  1 1 16 17
Split                    splitncnn_2              1 2 17 18 19
Convolution              conv_3                   1 1 19 20 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_68                  1 1 20 21
Convolution              conv_4                   1 1 21 22 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_69                  1 1 22 23
BinaryOp                 add_0                    2 1 18 23 24 0=0
Convolution              conv_5                   1 1 14 25 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_70                  1 1 25 26
Concat                   cat_1                    2 1 24 26 27 0=0
Convolution              conv_6                   1 1 27 28 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_71                  1 1 28 29
Convolution              conv_7                   1 1 29 30 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_72                  1 1 30 31
Split                    splitncnn_3              1 2 31 32 33
Convolution              conv_8                   1 1 33 34 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_73                  1 1 34 35
Split                    splitncnn_4              1 2 35 36 37
Convolution              conv_9                   1 1 37 38 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_74                  1 1 38 39
Convolution              conv_10                  1 1 39 40 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_75                  1 1 40 41
BinaryOp                 add_1                    2 1 36 41 42 0=0
Split                    splitncnn_5              1 2 42 43 44
Convolution              conv_11                  1 1 44 45 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_76                  1 1 45 46
Convolution              conv_12                  1 1 46 47 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_77                  1 1 47 48
BinaryOp                 add_2                    2 1 43 48 49 0=0
Split                    splitncnn_6              1 2 49 50 51
Convolution              conv_13                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_78                  1 1 52 53
Convolution              conv_14                  1 1 53 54 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_79                  1 1 54 55
BinaryOp                 add_3                    2 1 50 55 56 0=0
Convolution              conv_15                  1 1 32 57 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_80                  1 1 57 58
Concat                   cat_2                    2 1 56 58 59 0=0
Convolution              conv_16                  1 1 59 60 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_81                  1 1 60 61
Split                    splitncnn_7              1 2 61 62 63
Convolution              conv_17                  1 1 63 64 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_82                  1 1 64 65
Split                    splitncnn_8              1 2 65 66 67
Convolution              conv_18                  1 1 67 68 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_83                  1 1 68 69
Split                    splitncnn_9              1 2 69 70 71
Convolution              conv_19                  1 1 71 72 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_84                  1 1 72 73
Convolution              conv_20                  1 1 73 74 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_85                  1 1 74 75
BinaryOp                 add_4                    2 1 70 75 76 0=0
Split                    splitncnn_10             1 2 76 77 78
Convolution              conv_21                  1 1 78 79 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_86                  1 1 79 80
Convolution              conv_22                  1 1 80 81 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_87                  1 1 81 82
BinaryOp                 add_5                    2 1 77 82 83 0=0
Split                    splitncnn_11             1 2 83 84 85
Convolution              conv_23                  1 1 85 86 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_88                  1 1 86 87
Convolution              conv_24                  1 1 87 88 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_89                  1 1 88 89
BinaryOp                 add_6                    2 1 84 89 90 0=0
Convolution              conv_25                  1 1 66 91 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_90                  1 1 91 92
Concat                   cat_3                    2 1 90 92 93 0=0
Convolution              conv_26                  1 1 93 94 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_91                  1 1 94 95
Split                    splitncnn_12             1 2 95 96 97
Convolution              conv_27                  1 1 97 98 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_92                  1 1 98 99
Convolution              conv_28                  1 1 99 100 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_93                  1 1 100 101
Split                    splitncnn_13             1 4 101 102 103 104 105
Pooling                  maxpool2d_62             1 1 105 106 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Pooling                  maxpool2d_63             1 1 104 107 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_64             1 1 103 108 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Concat                   cat_4                    4 1 102 106 107 108 109 0=0
Convolution              conv_29                  1 1 109 110 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_94                  1 1 110 111
Split                    splitncnn_14             1 2 111 112 113
Convolution              conv_30                  1 1 113 114 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_95                  1 1 114 115
Convolution              conv_31                  1 1 115 116 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_96                  1 1 116 117
Convolution              conv_32                  1 1 117 118 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_97                  1 1 118 119
Convolution              conv_33                  1 1 112 120 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_98                  1 1 120 121
Concat                   cat_5                    2 1 119 121 122 0=0
Convolution              conv_34                  1 1 122 123 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_99                  1 1 123 124
Convolution              conv_35                  1 1 124 125 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_100                 1 1 125 126
Split                    splitncnn_15             1 2 126 127 128
Interp                   upsample_124             1 1 128 129 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_6                    2 1 129 96 130 0=0
Split                    splitncnn_16             1 2 130 131 132
Convolution              conv_36                  1 1 132 133 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_101                 1 1 133 134
Convolution              conv_37                  1 1 134 135 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_102                 1 1 135 136
Convolution              conv_38                  1 1 136 137 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_103                 1 1 137 138
Convolution              conv_39                  1 1 131 139 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_104                 1 1 139 140
Concat                   cat_7                    2 1 138 140 141 0=0
Convolution              conv_40                  1 1 141 142 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_105                 1 1 142 143
Convolution              conv_41                  1 1 143 144 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_106                 1 1 144 145
Split                    splitncnn_17             1 2 145 146 147
Interp                   upsample_125             1 1 147 148 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 148 62 149 0=0
Split                    splitncnn_18             1 2 149 150 151
Convolution              conv_42                  1 1 151 152 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_107                 1 1 152 153
Convolution              conv_43                  1 1 153 154 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_108                 1 1 154 155
Convolution              conv_44                  1 1 155 156 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_109                 1 1 156 157
Convolution              conv_45                  1 1 150 158 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_110                 1 1 158 159
Concat                   cat_9                    2 1 157 159 160 0=0
Convolution              conv_46                  1 1 160 161 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_111                 1 1 161 162
Split                    splitncnn_19             1 2 162 163 164
Convolution              conv_47                  1 1 164 165 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_112                 1 1 165 166
Concat                   cat_10                   2 1 166 146 167 0=0
Split                    splitncnn_20             1 2 167 168 169
Convolution              conv_48                  1 1 169 170 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_113                 1 1 170 171
Convolution              conv_49                  1 1 171 172 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_114                 1 1 172 173
Convolution              conv_50                  1 1 173 174 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_115                 1 1 174 175
Convolution              conv_51                  1 1 168 176 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_116                 1 1 176 177
Concat                   cat_11                   2 1 175 177 178 0=0
Convolution              conv_52                  1 1 178 179 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_117                 1 1 179 180
Split                    splitncnn_21             1 2 180 181 182
Convolution              conv_53                  1 1 182 183 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_118                 1 1 183 184
Concat                   cat_12                   2 1 184 127 185 0=0
Split                    splitncnn_22             1 2 185 186 187
Convolution              conv_54                  1 1 187 188 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_119                 1 1 188 189
Convolution              conv_55                  1 1 189 190 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_120                 1 1 190 191
Convolution              conv_56                  1 1 191 192 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_121                 1 1 192 193
Convolution              conv_57                  1 1 186 194 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_122                 1 1 194 195
Concat                   cat_13                   2 1 193 195 196 0=0
Convolution              conv_58                  1 1 196 197 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_123                 1 1 197 198
MemoryData               pnnx_96                  0 1 199 0=2 1=20 11=20 2=3
MemoryData               pnnx_97                  0 1 200 0=2 1=20 11=20 2=3
MemoryData               pnnx_98                  0 1 201 0=2 1=40 11=40 2=3
MemoryData               pnnx_99                  0 1 202 0=2 1=40 11=40 2=3
MemoryData               pnnx_101                 0 1 203 0=2 1=80 11=80 2=3
MemoryData               pnnx_103                 0 1 204 0=2 1=80 11=80 2=3
Convolution              conv_59                  1 1 163 205 0=39 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4992
Reshape                  view_135                 1 1 205 206 0=80 1=80 11=13 2=3
Permute                  permute_132              1 1 206 207 0=3
Sigmoid                  sigmoid_126              1 1 207 208
Slice                    split_0                  1 3 208 209 210 211 -23300=3,2,2,9 1=3
Eltwise                  weighted_sum_0           2 1 209 204 212 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_9                    1 1 212 213 0=2 1=1 2=8.000000e+00
BinaryOp                 mul_10                   1 1 210 214 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_11                   1 1 214 215 0=4
BinaryOp                 mul_12                   2 1 215 203 216 0=2
Concat                   cat_14                   3 1 213 216 211 217 0=3
Reshape                  view_136                 1 1 217 218 0=13 1=19200
Convolution              conv_60                  1 1 181 219 0=39 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9984
Reshape                  view_137                 1 1 219 220 0=40 1=40 11=13 2=3
Permute                  permute_133              1 1 220 221 0=3
Sigmoid                  sigmoid_127              1 1 221 222
Slice                    split_1                  1 3 222 223 224 225 -23300=3,2,2,9 1=3
Eltwise                  weighted_sum_1           2 1 223 202 226 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_15                   1 1 226 227 0=2 1=1 2=1.600000e+01
BinaryOp                 mul_16                   1 1 224 228 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_17                   1 1 228 229 0=4
BinaryOp                 mul_18                   2 1 229 201 230 0=2
Concat                   cat_15                   3 1 227 230 225 231 0=3
Reshape                  view_138                 1 1 231 232 0=13 1=4800
Convolution              conv_61                  1 1 198 233 0=39 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=19968
Reshape                  view_139                 1 1 233 234 0=20 1=20 11=13 2=3
Permute                  permute_134              1 1 234 235 0=3
Sigmoid                  sigmoid_128              1 1 235 236
Slice                    split_2                  1 3 236 237 238 239 -23300=3,2,2,9 1=3
Eltwise                  weighted_sum_2           2 1 237 200 240 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_21                   1 1 240 241 0=2 1=1 2=3.200000e+01
BinaryOp                 mul_22                   1 1 238 242 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_23                   1 1 242 243 0=4
BinaryOp                 mul_24                   2 1 243 199 244 0=2
Concat                   cat_16                   3 1 241 244 239 245 0=3
Reshape                  view_140                 1 1 245 246 0=13 1=1200
Concat                   cat_17                   3 1 218 232 246 out0 0=0
